In [1]:
import numpy  as np
import pandas as pd

In [2]:
data = {
'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
'Age': [25, 30, 22, 35, 28],
'Salary': [50000, 60000, 45000, 70000, 55000],
'Department': ['HR', 'Finance', 'IT', 'Finance', 'IT']
}

df = pd.DataFrame(data)

In [3]:
df

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000    Finance
2  Charlie   22   45000         IT
3    David   35   70000    Finance
4      Eve   28   55000         IT

## 1. Sort the DataFrame df by the 'Name' column in ascending order.

In [6]:
df.sort_values(by="Name",ascending=True)

      Name  Age  Salary Department
0    Alice   25   50000         HR
1      Bob   30   60000    Finance
2  Charlie   22   45000         IT
3    David   35   70000    Finance
4      Eve   28   55000         IT

## 2.Sort the DataFrame df by the 'Salary' column in descending order.

In [7]:
df.sort_values(by="Salary",ascending=False)

      Name  Age  Salary Department
3    David   35   70000    Finance
1      Bob   30   60000    Finance
4      Eve   28   55000         IT
0    Alice   25   50000         HR
2  Charlie   22   45000         IT

## 3.Create a new DataFrame that contains only the rows where 'Age' is greater than 25.

In [11]:
filter = df['Age'] > 25
df_new = df[filter]
df_new

    Name  Age  Salary Department
1    Bob   30   60000    Finance
3  David   35   70000    Finance
4    Eve   28   55000         IT

## 4. Create a new DataFrame that contains only the rows where 'Department' is 'Finance'.

In [12]:
df_new = df[df['Department'] == 'Finance']
df_new

    Name  Age  Salary Department
1    Bob   30   60000    Finance
3  David   35   70000    Finance

## 5. Use the .where() method to create a new DataFrame where 'Salary' is greater than 55000, and replace the rest with NaN.

In [13]:
df.where(cond=df['Salary']>55000,other=np.nan)

    Name   Age   Salary Department
0    NaN   NaN      NaN        NaN
1    Bob  30.0  60000.0    Finance
2    NaN   NaN      NaN        NaN
3  David  35.0  70000.0    Finance
4    NaN   NaN      NaN        NaN

## 6. Use the .filter() method to filter the columns to include only 'Name' and 'Department'.

In [15]:
df_new = df.filter(items=['Name','Department'])
df_new

      Name Department
0    Alice         HR
1      Bob    Finance
2  Charlie         IT
3    David    Finance
4      Eve         IT

## 7 . Calculate the mean age of employees in the DataFrame.

In [17]:
mean_value = df['Age'].mean()
mean_value

28.0

## 8. Calculate the maximum salary in the DataFrame.

In [18]:
max_salary = df['Salary'].max()
max_salary

70000

## 9 . Create a DataFrame where any rows with missing values (NaN) in any column are removed.

In [19]:
data = {
    'Name': ['Alice', 'Bob', np.nan, 'David', 'Eve'],
    'Age': [25, 30, 22, 35, np.nan],
    'Salary': [50000, 60000, 45000, 70000, 55000],
    'Department': ['HR', 'Finance', 'IT', 'Finance', 'IT']
}

df = pd.DataFrame(data)

In [20]:
df

    Name   Age  Salary Department
0  Alice  25.0   50000         HR
1    Bob  30.0   60000    Finance
2    NaN  22.0   45000         IT
3  David  35.0   70000    Finance
4    Eve   NaN   55000         IT

In [21]:
new_df = df.dropna(axis=0)
new_df

    Name   Age  Salary Department
0  Alice  25.0   50000         HR
1    Bob  30.0   60000    Finance
3  David  35.0   70000    Finance

## 10. Fill the missing values in the 'Salary' column with the mean salary of the remaining employees.

In [22]:
data = {
    'Name': ['Alice', 'Bob', "Robin", 'David', 'Eve'],
    'Age': [25, 30, 22, 35, 60],
    'Salary': [50000, 60000, np.nan, 70000, 55000],
    'Department': ['HR', 'Finance', 'IT', 'Finance', 'IT']
}

df = pd.DataFrame(data)
df

    Name  Age   Salary Department
0  Alice   25  50000.0         HR
1    Bob   30  60000.0    Finance
2  Robin   22      NaN         IT
3  David   35  70000.0    Finance
4    Eve   60  55000.0         IT

In [24]:
mean_salary = df['Salary'].mean()
df['Salary'] = df['Salary'].fillna(mean_salary)
df

    Name  Age   Salary Department
0  Alice   25  50000.0         HR
1    Bob   30  60000.0    Finance
2  Robin   22  58750.0         IT
3  David   35  70000.0    Finance
4    Eve   60  55000.0         IT